{
  "Games for your brain": "Игры для вашего разума",
  "Memory game": "Игра на запоминание",
  "Sudoku": "Судоку",
  "Home": "Главная",
  "Rules": "Правила",
  "New game": "Новая игра",
  "Choose your level:": "Выбери уровень:",
  "Easy": "Легкий",
  "Average": "Средний",
  "Hard": "Тяжелый",
  "Start game": "Начать игру",
  "You won this memory game": "Ты выграл эту игру",
  "You won this sudoku": "Ты выиграл судоку",
  "Clk": "Нажатий:",
  "Same cards:": "Одинаковые карточки:",
  "T": "Время:",
  "Rules of memory game:": "Правила игры на память:",
  "Rules of sudoku:": "Правила судоку:",
  "The deck consists of different card types": "Колода состоит из карт разного типа",
  "Each turn, you flip over two cards (one at a time, so you can see the first one before picking the second)": "Каждый ход вы переворачиваете две карты (по одной, чтобы вы могли видеть первую перед тем, как взять вторую)",
  "If the two cards match, then they are left opened in the game, otherwise they are returned": "Если две карты совпадают, то они остаются в игре открытыми, в противном случае возвращаются.",
  "The game ends when all the cards are opened": "Игра заканчивается, когда все карты открыты",
  "Sudoku grid consists of 9x9 spaces": "Сетка судоку состоит из клеток 9x9.",
  "You can use only numbers from 1 to 9": "Вы можете использовать только цифры от 1 до 9",
  "Each 3×3 block can only contain numbers from 1 to 9": "Каждый блок 3×3 может содержать только числа от 1 до 9.",
  "Each vertical column can only contain numbers from 1 to 9": "Каждый вертикальный столбец может содержать только числа от 1 до 9.",
  "Each horizontal row can only contain numbers from 1 to 9": "Каждая горизонтальная строка может содержать только числа от 1 до 9.",
  "Each number in the 3×3 block, vertical column or horizontal row can be used only once": "Каждое число в блоке 3×3, вертикальном столбце или горизонтальной строке можно использовать только один раз.",
  "The game is over when the whole Sudoku grid is correctly filled with numbers": "Игра окончена, когда вся сетка судоку правильно заполнена числами.",
  "Last free cell technique": "Метод последней свободной клетки",
  "Last free cell is the basic Sudoku solving technique. It's pretty simple and based on the fact that each 3×3 block, vertical column or horizontal row on Sudoku grid should contain numbers from 1 to 9 and each number can be used only once within 3×3 block, vertical column or horizontal row. Therefore, if we see that there is only one free cell left in the 3×3 block, vertical column or horizontal row, then we have to define which number from 1 to 9 is missing and enter it in this empty cell. You can see how it looks in the examples below. This is the main basic rule. Once you have learned it, you can proceed with the following Sudoku strategies.": "Последняя свободная ячейка — основная техника решения судоку. Это довольно просто и основано на том факте, что каждый блок 3×3, вертикальный столбец или горизонтальная строка в сетке судоку должны содержать числа от 1 до 9, и каждое число может использоваться только один раз в блоке 3×3, вертикальном столбце или горизонтальной строке. Поэтому, если мы видим, что в блоке 3х3, вертикальном столбце или горизонтальной строке осталась только одна свободная ячейка, то мы должны определить, какое число от 1 до 9 отсутствует, и вписать его в эту пустую ячейку. Вы можете увидеть, как это выглядит на примерах ниже. Это основное основное правило. После того, как вы изучите его, вы можете приступить к следующим стратегиям судоку.",
  "Last remaining cell technique": "Техника последней оставшейся клеточки",
  "Last remaining cell is another basic Sudoku strategy. It's based on the fact that numbers should not be repeated within 3×3 block, vertical column and horizontal row. Let's take a look at an example with the 3x3 block. There always must be number 8 - in each block, column and row. There's already 8 in the column and in the row. As we already know, we can't repeat numbers. So we can't place 8 there again. It means that there's only one cell remaining inside the block and we should put number 8 into it. The same technique applies to the Rows and Columns. That is how Last remaining cell technique can be used while solving Sudoku. Once you have learned it, you can proceed with the following Sudoku strategies.": "Последняя оставшаяся ячейка — еще одна базовая стратегия судоку. Он основан на том, что числа не должны повторяться в блоке 3х3, вертикальном столбце и горизонтальной строке. Давайте рассмотрим пример с блоком 3x3. Всегда должно быть число 8 - в каждом блоке, столбце и строке. Там уже 8 в столбце и в строке. Как мы уже знаем, мы не можем повторять числа. Таким образом, мы не можем поставить 8 там снова. Это означает, что внутри блока осталась только одна ячейка, и в нее нужно поместить число 8. Тот же метод применяется к строкам и столбцам. Вот как можно использовать технику «Последняя оставшаяся ячейка» при решении судоку. После того, как вы изучите его, вы можете приступить к следующим стратегиям судоку.",
  "Last possible number technique": "Техника последнего возможного числа",
  "Last possible number is a simple strategy that is suitable for beginners. It is based on finding the missing number. To find the missing number you should take a look at the numbers that are already exist in the 3x3 block you are interested in, and in the rows and columns connected with it. Let's take a look at an example. Pay attention to the highlighted cell. Look at the numbers in its block, row and column. We can see that numbers 1,2,3,4,6,7,8,9 are already used in this row, column and block. The only missing number is 5. Considering that numbers should not be repeated, the only number that must be put in this cell is 5. That is how Last possible number technique works. Once you have mastered it, you will begin to solve Sudoku easier and faster!": "Последнее возможное число — это простая стратегия, подходящая для новичков. Он основан на поиске пропущенного числа. Чтобы найти пропущенное число, следует просмотреть числа, которые уже есть в интересующем вас блоке 3x3, а также в связанных с ним строках и столбцах. Давайте посмотрим на пример. Обратите внимание на выделенную ячейку. Посмотрите на числа в его блоке, строке и столбце. Мы видим, что числа 1,2,3,4,6,7,8,9 уже используются в этой строке, столбце и блоке. Единственное пропущенное число — 5. Учитывая, что числа не должны повторяться, единственное число, которое нужно поставить в эту ячейку, — 5. Так работает техника последнего возможного числа. Как только вы освоите его, вы начнете решать судоку проще и быстрее!",
  "Obvious singles technique": "Очевидная техника одиночных игр",
  "This strategy is based on the correct placement of Notes. Sometimes it is called Naked Singles. The point is that in a specific cell only one digit (from the Notes) remains possible. Let's have look at this case with an example. Let's look at the highlited cell. We can see that it is filled with only one Note - number 2. It means that this cell has only one possible solution. Since it is the only possible option, this cell will be 2. So we remove Note from this cell and fill it with the number 2. That is how Obvious singles technique works. As you see, this is not as difficult as it seems. Therefore, if you put Obvious singles technique into practice, the process of solving Sudoku will become easier and faster!": "Эта стратегия основана на правильном размещении нот. Иногда его называют Naked Singles. Дело в том, что в конкретной ячейке возможна только одна цифра (из Примечаний). Давайте рассмотрим этот случай на примере. Посмотрим на выделенную ячейку. Мы видим, что она заполнена только одной нотой - номером 2. Это означает, что эта ячейка имеет только одно возможное решение. Так как это единственно возможный вариант, то в этой ячейке будет 2. Поэтому мы удаляем Примечание из этой ячейки и заполняем ее цифрой 2. Так работает техника Очевидных одиночек. Как видите, это не так сложно, как кажется. Поэтому, если вы будете применять технику Очевидных одиночек на практике, процесс решения Судоку станет проще и быстрее!",
  "Obvious pairs technique": "Техника очевидных пар",
  "Like the Obvious Singles technique, Obvious pairs is based on the correct placement of Notes. The point is that you should find 2 cells with the same pairs of Notes within 3x3 block. This means that these pairs of Notes cannot be used in other cells within this 3x3 block. So they can be removed from your Notes. It will be easier to understand this strategy if you look at the example. Let's look at this block. We see empty cells filled with notes of possible numbers. Among them, there are two cells that contain 7 or 9. This means that one of these cells necessarily contains 7 and the other one contains 9. This also means that we can't have 7 and 9 in other cells of this block. Hence, we remove them from other cells' notes. Next we can apply the Obvious singles rule we learned in the previous lesson. We'll write 6 in the cell with a single note of 6 and and 4 in another one. That is how Obvious Pairs technique can be used while solving Sudoku. Once you have learned it, you can proceed with the following Sudoku strategies.": "Подобно технике очевидных одиночек, очевидные пары основаны на правильном размещении нот. Суть в том, что вы должны найти 2 ячейки с одинаковыми парами Нот внутри блока 3х3. Это означает, что эти пары заметок нельзя использовать в других ячейках этого блока 3х3. Так что их можно удалить из ваших заметок. Понять эту стратегию будет проще, если вы посмотрите на пример. Давайте посмотрим на этот блок. Мы видим пустые ячейки, заполненные записями возможных чисел. Среди них есть две клетки, которые содержат 7 или 9. Это означает, что одна из этих ячеек обязательно содержит 7, а другая содержит 9. Это также означает, что мы не можем иметь 7 и 9 в других ячейках этого блока. Следовательно, мы удаляем их из заметок других ячеек. Затем мы можем применить очевидное правило одиночных чисел, которое мы изучили на предыдущем уроке. Мы напишем 6 в ячейке с одной нотой 6 и и 4 в другой. Вот как можно использовать технику очевидных пар при решении судоку. После того, как вы изучите его, вы можете приступить к следующим стратегиям судоку.",
  "Obvious triples technique": "Очевидная техника троек",
  "This Sudoku solving technique is built upon the previous one - Obvious pairs. But Obvious triples is not based on two numbers from the Notes, it's based on three. This is the only difference. To understand better, let's take a look at the example. Look at the top left block. Its three bottom cells contain notes of 1, 5; 1, 8 & 5, 8. This means that these cells have number 1, 5 & 8 in them but we don't know yet where each number is exactly. What we know though, is that 1, 5 & 8 can't be in other cells of this block. So, we can remove them from the notes. That is how Obvious Triples technique works while solving Sudoku.": "Эта техника решения судоку основана на предыдущей — очевидных парах. Но очевидные тройки основаны не на двух числах из Notes, а на трех. Это единственная разница. Чтобы лучше понять, давайте посмотрим на пример. Посмотрите на верхний левый блок. Три его нижние ячейки содержат ноты 1, 5; 1, 8 и 5, 8. Это означает, что в этих ячейках есть числа 1, 5 и 8, но мы еще не знаем, где именно находится каждое число. Однако мы знаем, что 1, 5 и 8 не могут находиться в других ячейках этого блока. Итак, мы можем удалить их из заметок. Вот как работает техника очевидных троек при решении судоку.",
  "Hidden singles technique": "Техника скрытых синглов",
  "Hidden singles is a quite simple Sudoku technique. The point of Hidden singles is that a Note is the only one of its kind in an entire row, column, or 3x3 block. However, this technique requires careful attention from the player, because it can be quite hard to spot the single Notes. It will be easier to understand this technique if you look at the example. Let's pay attention to this 3x3 block with Notes. There is only one cell, that may contain number 1. It's the top right cell. There are no any other cells in this block whith the Note 1. So we can remove all the Notes from this cell and put number 1 instead, since it's the only possible option. That's it for Hidden singles technique. Once you have learned it, you can proceed with the following Sudoku strategies.": "Скрытые одиночные числа — довольно простая техника судоку. Суть скрытых одиночных записей в том, что заметка является единственной в своем роде во всей строке, столбце или блоке 3x3. Однако эта техника требует от игрока пристального внимания, потому что обнаружить отдельные ноты может быть довольно сложно. Вам будет легче понять эту технику, если вы посмотрите на пример. Обратим внимание на этот блок 3х3 с заметками. Есть только одна ячейка, которая может содержать число 1. Это верхняя правая ячейка. Других ячеек в этом блоке с примечанием 1 нет. Поэтому мы можем удалить все примечания из этой ячейки и поставить вместо них число 1, так как это единственно возможный вариант. Вот и все, что касается техники скрытых одиночных игр. После того, как вы изучите его, вы можете приступить к следующим стратегиям судоку.",
  "Hidden pairs technique": "Техника скрытых пар",
  "Hidden pairs technique works the same way as Hidden singles. The only thing that changes is the number of cells and Notes. If you can find two cells within a row, column, or 3x3 block where two Notes appear nowhere outside these cells, these two Notes must be placed in the two cells. All other Notes can be eliminated from these two cells. For example: Let's pay attention to this block with Notes and look for the numbers that can be found in Notes less often than others. Only two cells contain 2 and 6. This means 2 must occupy one of these cells and 6 must occupy another. Any other numbers cannot be found in these cells. After this conclusion, extra numbers can be deleted from the Notes to avoid confusion. So, you know how to apply Hidden pairs technique in Sudoku. Now it's time for some practice!": "Техника скрытых пар работает так же, как и скрытые одиночные игры. Единственное, что меняется, это количество ячеек и заметок. Если вы можете найти две ячейки в строке, столбце или блоке 3x3, где два примечания не появляются нигде за пределами этих ячеек, эти два примечания должны быть помещены в две ячейки. Все остальные примечания можно исключить из этих двух ячеек. Например: Давайте обратим внимание на этот блок с Заметками и поищем числа, которые можно встретить в Заметках реже других. Только две клетки содержат числа 2 и 6. Это означает, что число 2 должно занимать одну из этих ячеек, а число 6 — другую. В этих ячейках нельзя найти никаких других чисел. После этого вывода лишние цифры можно удалить из примечаний, чтобы избежать путаницы. Итак, вы знаете, как применять технику скрытых пар в судоку. Теперь пришло время для некоторой практики!",
  "Hidden triples technique": "Техника скрытых троек",
  "Hidden triples technique is very similar to Hidden pairs and works on the same concept. Hidden triples applies when three cells in a row, column, or 3x3 block contain the same three Notes. These three cells also contain other candidates, which may be removed from them. It will be easier to understand this technique if you look at the example. Take a look at the highlighted cells. There are only three cells, which contain repeated numbers: 5, 6 and 7. This means each of these numbers must occupy one of these cells. And any other numbers cannot be found here. If so, 5,6 and 7 cannot be presented in any other cell of this 3x3 block as well. After this conclusion, extra numbers can be deleted from the Notes to avoid confusion. That is how Hidden Triples technique works while solving Sudoku.": "Техника скрытых троек очень похожа на технику скрытых пар и работает по тому же принципу. Скрытые тройки применяются, когда три ячейки в строке, столбце или блоке 3x3 содержат одни и те же три примечания. Эти три ячейки также содержат других кандидатов, которые могут быть удалены из них. Вам будет легче понять эту технику, если вы посмотрите на пример. Взгляните на выделенные ячейки. Есть только три ячейки, в которых записаны повторяющиеся числа: 5, 6 и 7. Это означает, что каждое из этих чисел должно занимать одну из этих ячеек. И никаких других цифр здесь не найти. Если это так, то числа 5,6 и 7 не могут быть представлены ни в одной другой ячейке этого блока 3х3. После этого вывода лишние цифры можно удалить из примечаний, чтобы избежать путаницы. Вот как работает техника скрытых троек при решении судоку.",
  "Pointing pairs technique": "Техника указательных пар",
  "Pointing pairs applies when a Note is present twice in a block and this Note also belongs to the same row or column. This means that the Note must be the solution for one of the two cells in the block. So, you can eliminate this Note from any other cells in the row or column. To understand Pointing pairs better, let's take a look at the example. Let's look at the block at the top left corner. All the cells that might contain number 4 are located in one column. As number 4 should appear in this block at least once, one of the highlighted cells will surely contain 4. Hence, we can safely eliminate all other possible 4s from all the cells of this column. Remember that you can do the same trick for blocks, rows, and columns. That's it for Pointing pairs technique. Now you can proceed with the following Sudoku strategy Pointing triples.": "Пары указателей применяются, когда примечание присутствует в блоке дважды, и это примечание также принадлежит одной и той же строке или столбцу. Это означает, что примечание должно быть решением для одной из двух ячеек блока. Таким образом, вы можете удалить это примечание из любых других ячеек в строке или столбце. Чтобы лучше понять пары Pointing, давайте рассмотрим пример. Посмотрим на блок в левом верхнем углу. Все ячейки, которые могут содержать число 4, расположены в одном столбце. Так как число 4 должно появиться в этом блоке хотя бы один раз, то в одной из выделенных ячеек обязательно будет число 4. Следовательно, мы можем смело исключить все остальные возможные четверки из всех ячеек этого столбца. Помните, что вы можете проделать тот же трюк с блоками, строками и столбцами. Вот и все, что касается техники Pointing Pairs. Теперь вы можете приступить к следующей стратегии судоку «Указывающие тройки».",
  "Pointing triples technique": "Техника указательных троек",
  "Pointing triples technique is very similar to Pointing pairs. It applies if a Note is present in only three cells of a 3x3 block and also belongs to the same row or column. This means that the Note must be a solution for one of these three cells in the block. So, obviously it can't be a solution of any other cell in the row or column and can be eliminated from them. For example: Let's take a look at the bottom right corner. In this block all the cells that might contain number 1 are located in one row. As number 1 must appear in the bottom right block at least once, one of the highlighted cells will surely contain 1. After this conclusion all other possible numbers 1 can be safely deleted from the Notes of this row to avoid confusion. Remember that you can do the same trick for blocks, rows, and columns. That is how Pointing Triples technique works. Once you have learned it, you can get some practice.": "Техника троек Pointing очень похожа на пары Pointing. Это применимо, если примечание присутствует только в трех ячейках блока 3x3, а также принадлежит той же строке или столбцу. Это означает, что Заметка должна быть решением для одной из этих трех ячеек в блоке. Итак, очевидно, что оно не может быть решением какой-либо другой ячейки в строке или столбце и может быть исключено из них. Например: Давайте посмотрим на нижний правый угол. В этом блоке все ячейки, которые могут содержать число 1, расположены в одной строке. Так как число 1 должно появиться в нижнем правом блоке хотя бы один раз, то в одной из выделенных ячеек обязательно будет 1. После этого вывода все остальные возможные числа 1 можно смело вычеркнуть из Примечаний этой строки, чтобы не было путаницы. Помните, что вы можете проделать тот же трюк с блоками, строками и столбцами. Вот как работает техника Pointing Triples. После того, как вы изучите его, вы можете получить некоторую практику."
}