{
  "Games for your brain": "Ігри для вашого розуму",
  "Memory game": "Гра на запам'ятовування",
  "Sudoku": "Судоку",
  "Home": "Головна",
  "Rules": "Правила",
  "New game": "Нова гра",
  "Choose your level:": "Обери рівень:",
  "Easy": "Легкий",
  "Average": "Середній",
  "Hard": "Важкий",
  "Start game": "Почати гру",
  "You won this memory game": "Ты виграв цю гру",
  "You won this sudoku": "Ти виграв судоку",
  "Clk": "Натисканнь:",
  "Same cards:": "Однакові картки:",
  "T": "Час:",
  "Rules of memory game:": "Правила гри на пам'ять:",
  "Rules of sudoku:": "Правила судоку:",
  "The deck consists of different card types": "Колода складається з різних типів карт",
  "Each turn, you flip over two cards (one at a time, so you can see the first one before picking the second)": "Кожен хід ви перегортаєте дві карти (по одній, щоб ви могли побачити першу, перш ніж вибрати другу",
  "If the two cards match, then they are left opened in the game, otherwise they are returned": "Якщо дві карти збігаються, вони залишаються відкритими в грі, інакше вони повертаються",
  "The game ends when all the cards are opened": "Гра закінчується, коли всі карти відкриті",
  "Sudoku grid consists of 9x9 spaces": "Сітка судоку складається з 9x9 проміжків",
  "You can use only numbers from 1 to 9": "Можна використовувати тільки цифри від 1 до 9",
  "Each 3×3 block can only contain numbers from 1 to 9": "Кожен блок 3×3 може містити лише числа від 1 до 9",
  "Each vertical column can only contain numbers from 1 to 9": "Кожен вертикальний стовпець може містити лише числа від 1 до 9",
  "Each horizontal row can only contain numbers from 1 to 9": "Кожен горизонтальний рядок може містити лише числа від 1 до 9",
  "Each number in the 3×3 block, vertical column or horizontal row can be used only once": "Кожне число в блоці 3×3, вертикальному стовпчику чи горизонтальному рядку можна використати лише один раз",
  "The game is over when the whole Sudoku grid is correctly filled with numbers": "Гра закінчена, коли вся сітка Судоку буде правильно заповнена числами",
  "Last free cell technique": "Техніка останньої вільної клітини",
  "Last free cell is the basic Sudoku solving technique. It's pretty simple and based on the fact that each 3×3 block, vertical column or horizontal row on Sudoku grid should contain numbers from 1 to 9 and each number can be used only once within 3×3 block, vertical column or horizontal row. Therefore, if we see that there is only one free cell left in the 3×3 block, vertical column or horizontal row, then we have to define which number from 1 to 9 is missing and enter it in this empty cell. You can see how it looks in the examples below. This is the main basic rule. Once you have learned it, you can proceed with the following Sudoku strategies.": "Остання вільна клітинка — це базова техніка розв’язування судоку. Вона досить проста й базується на тому, що кожен блок 3×3, вертикальний стовпець або горизонтальний рядок на сітці судоку має містити числа від 1 до 9, і кожне число можна використати лише один раз у межах Блок 3 × 3, вертикальний стовпець або горизонтальний рядок.Отже, якщо ми бачимо, що в блоці 3 × 3, вертикальному стовпчику чи горизонтальному рядку залишилася лише одна вільна клітинка, то ми повинні визначити, якого числа від 1 до 9 не вистачає і введіть його в цю порожню комірку. Ви можете побачити, як це виглядає в наведених нижче прикладах. Це основне базове правило. Після того, як ви його вивчите, ви можете продовжувати використовувати наступні стратегії судоку.",
  "Last remaining cell technique": "Техніка останьої клітини",
  "Last remaining cell is another basic Sudoku strategy. It's based on the fact that numbers should not be repeated within 3×3 block, vertical column and horizontal row. Let's take a look at an example with the 3x3 block. There always must be number 8 - in each block, column and row. There's already 8 in the column and in the row. As we already know, we can't repeat numbers. So we can't place 8 there again. It means that there's only one cell remaining inside the block and we should put number 8 into it. The same technique applies to the Rows and Columns. That is how Last remaining cell technique can be used while solving Sudoku. Once you have learned it, you can proceed with the following Sudoku strategies.": "Остання клітина, що залишилася, є ще однією базовою стратегією судоку. Він заснований на тому, що числа не повинні повторюватися в блоці 3×3, вертикальному стовпчику та горизонтальному рядку. Давайте розглянемо приклад з блоком 3х3. Завжди має бути число 8 - у кожному блоці, стовпці та рядку. У стовпчику і в рядку вже 8. Як ми вже знаємо, ми не можемо повторювати числа. Тож ми не можемо знову поставити 8 туди. Це означає, що всередині блоку залишилася лише одна клітинка, і ми повинні поставити в неї число 8. Така ж техніка застосовується до рядків і стовпців. Таким чином під час вирішення судоку можна використовувати техніку «Остання клітинка, що залишилася». Після того, як ви вивчите це, ви можете продовжити наступні стратегії судоку.",
  "Last possible number technique": "Техніка останнього можливого числа",
  "Last possible number is a simple strategy that is suitable for beginners. It is based on finding the missing number. To find the missing number you should take a look at the numbers that are already exist in the 3x3 block you are interested in, and in the rows and columns connected with it. Let's take a look at an example. Pay attention to the highlighted cell. Look at the numbers in its block, row and column. We can see that numbers 1,2,3,4,6,7,8,9 are already used in this row, column and block. The only missing number is 5. Considering that numbers should not be repeated, the only number that must be put in this cell is 5. That is how Last possible number technique works. Once you have mastered it, you will begin to solve Sudoku easier and faster!": "Останнє можливе число - це проста стратегія, яка підходить новачкам. Він заснований на пошуку пропущеного числа. Щоб знайти відсутнє число, слід подивитися на числа, які вже є в цікавому для вас блоці 3х3, а також у рядках і стовпцях, пов'язаних з ним. Давайте розглянемо приклад. Зверніть увагу на виділену клітинку. Подивіться на числа в його блоці, рядку та стовпці. Ми бачимо, що числа 1,2,3,4,6,7,8,9 вже використовуються в цьому рядку, стовпці та блоці. Єдиним відсутнім числом є 5. З огляду на те, що числа не повинні повторюватися, єдине число, яке потрібно вставити в цю комірку, це 5. Так працює техніка останнього можливого числа. Опанувавши це, ви почнете розгадувати судоку легше та швидше!",
  "Obvious singles technique": "Очевидна одиночна техніка",
  "This strategy is based on the correct placement of Notes. Sometimes it is called Naked Singles. The point is that in a specific cell only one digit (from the Notes) remains possible. Let's have look at this case with an example. Let's look at the highlited cell. We can see that it is filled with only one Note - number 2. It means that this cell has only one possible solution. Since it is the only possible option, this cell will be 2. So we remove Note from this cell and fill it with the number 2. That is how Obvious singles technique works. As you see, this is not as difficult as it seems. Therefore, if you put Obvious singles technique into practice, the process of solving Sudoku will become easier and faster!": "Ця стратегія заснована на правильному розташуванні Нотаток. Іноді його називають «Голі одинаки». Справа в тому, що в конкретній клітинці залишається можлива лише одна цифра (з Приміток). Давайте розглянемо цей випадок на прикладі. Давайте подивимося на виділену комірку. Ми бачимо, що вона заповнена лише однією приміткою - номером 2. Це означає, що ця клітинка має лише одне можливе рішення. Оскільки це єдиний можливий варіант, ця комірка буде 2. Тож ми видаляємо Note з цієї комірки та заповнюємо її числом 2. Так працює техніка Ovidous singles. Як бачите, це не так складно, як здається. Тому, якщо застосувати на практиці техніку «Очевидні одиночки», процес вирішення судоку стане легшим і швидшим!",
  "Obvious pairs technique": "Техніка наочних пар",
  "Like the Obvious Singles technique, Obvious pairs is based on the correct placement of Notes. The point is that you should find 2 cells with the same pairs of Notes within 3x3 block. This means that these pairs of Notes cannot be used in other cells within this 3x3 block. So they can be removed from your Notes. It will be easier to understand this strategy if you look at the example. Let's look at this block. We see empty cells filled with notes of possible numbers. Among them, there are two cells that contain 7 or 9. This means that one of these cells necessarily contains 7 and the other one contains 9. This also means that we can't have 7 and 9 in other cells of this block. Hence, we remove them from other cells' notes. Next we can apply the Obvious singles rule we learned in the previous lesson. We'll write 6 in the cell with a single note of 6 and and 4 in another one. That is how Obvious Pairs technique can be used while solving Sudoku. Once you have learned it, you can proceed with the following Sudoku strategies.": "Як і техніка «Очевидні одинаки», «Очевидні пари» засновані на правильному розміщенні нот. Справа в тому, що ви повинні знайти 2 клітинки з однаковими парами нот в блоці 3х3. Це означає, що ці пари нотаток не можна використовувати в інших комірках цього блоку 3x3. Тож їх можна видалити з ваших Нотаток. Зрозуміти цю стратегію буде легше, якщо ви подивіться на приклад. Давайте подивимося на цей блок. Ми бачимо порожні клітинки, заповнені позначками можливих чисел. Серед них є дві клітинки, які містять 7 або 9. Це означає, що одна з цих клітинок обов’язково містить 7, а інша містить 9. Це також означає, що ми не можемо мати 7 і 9 в інших клітинках цього блоку. Тому ми видаляємо їх із приміток інших клітинок. Далі ми можемо застосувати правило очевидних одинаків, яке ми вивчали на попередньому уроці. Ми запишемо 6 у клітинку з однією нотою 6 і 4 в іншій. Ось як можна використовувати техніку «Очевидні пари» під час вирішення судоку. Після того, як ви вивчите це, ви можете продовжити наступні стратегії судоку.",
  "Obvious triples technique": "Очевидна техніка трійок",
  "This Sudoku solving technique is built upon the previous one - Obvious pairs. But Obvious triples is not based on two numbers from the Notes, it's based on three. This is the only difference. To understand better, let's take a look at the example. Look at the top left block. Its three bottom cells contain notes of 1, 5; 1, 8 & 5, 8. This means that these cells have number 1, 5 & 8 in them but we don't know yet where each number is exactly. What we know though, is that 1, 5 & 8 can't be in other cells of this block. So, we can remove them from the notes. That is how Obvious Triples technique works while solving Sudoku.": "Ця техніка розв’язування судоку побудована на основі попередньої – Очевидні пари. Але Очевидні трійки базуються не на двох числах із Приміток, а на трьох. Це єдина різниця. Щоб краще зрозуміти, розглянемо приклад. Подивіться на верхній лівий блок. Його три нижні комірки містять ноти 1, 5; 1, 8 і 5, 8. Це означає, що в цих комірках є числа 1, 5 і 8, але ми ще не знаємо, де саме знаходиться кожне число. Однак ми знаємо, що 1, 5 і 8 не можуть бути в інших клітинках цього блоку. Отже, ми можемо видалити їх із нотаток. Так працює техніка «Очевидні трійки» під час вирішення судоку.",
  "Hidden singles technique": "Прихована одиночна техніка",
  "Hidden singles is a quite simple Sudoku technique. The point of Hidden singles is that a Note is the only one of its kind in an entire row, column, or 3x3 block. However, this technique requires careful attention from the player, because it can be quite hard to spot the single Notes. It will be easier to understand this technique if you look at the example. Let's pay attention to this 3x3 block with Notes. There is only one cell, that may contain number 1. It's the top right cell. There are no any other cells in this block whith the Note 1. So we can remove all the Notes from this cell and put number 1 instead, since it's the only possible option. That's it for Hidden singles technique. Once you have learned it, you can proceed with the following Sudoku strategies.": "Приховані сингли - це досить проста техніка судоку. Суть прихованих синглів полягає в тому, що нотатка є єдиною у своєму роді в цілому рядку, стовпці чи блоці 3x3. Однак ця техніка вимагає пильної уваги від гравця, оскільки буває досить важко помітити окремі ноти. Зрозуміти цю техніку буде простіше, якщо подивитися на приклад. Звернемо увагу на цей блок 3х3 з Примітками. Є лише одна клітинка, яка може містити число 1. Це верхня права клітинка. У цьому блоці немає інших комірок разом із Приміткою 1. Тому ми можемо видалити всі Примітки з цієї комірки та поставити замість них номер 1, оскільки це єдиний можливий варіант. Ось і все, що стосується техніки прихованих синглів. Після того, як ви вивчите це, ви можете продовжити наступні стратегії судоку.",
  "Hidden pairs technique": "Техніка прихованих пар",
  "Hidden pairs technique works the same way as Hidden singles. The only thing that changes is the number of cells and Notes. If you can find two cells within a row, column, or 3x3 block where two Notes appear nowhere outside these cells, these two Notes must be placed in the two cells. All other Notes can be eliminated from these two cells. For example: Let's pay attention to this block with Notes and look for the numbers that can be found in Notes less often than others. Only two cells contain 2 and 6. This means 2 must occupy one of these cells and 6 must occupy another. Any other numbers cannot be found in these cells. After this conclusion, extra numbers can be deleted from the Notes to avoid confusion. So, you know how to apply Hidden pairs technique in Sudoku. Now it's time for some practice!": "Техніка прихованих пар працює так само, як і прихованих одиночних. Єдине, що змінюється, це кількість комірок і Приміток. Якщо ви можете знайти дві клітинки в рядку, стовпці або блоці 3x3, де дві нотатки не з’являються ніде поза цими клітинками, ці дві нотатки мають бути розміщені у двох клітинках. Усі інші примітки можна видалити з цих двох комірок. Наприклад: Давайте звернемо увагу на цей блок з Notes і пошукаємо числа, які зустрічаються в Notes рідше інших. Лише дві клітинки містять 2 і 6. Це означає, що 2 має займати одну з цих клітинок, а 6 має займати іншу. Будь-які інші числа в цих клітинках знайти неможливо. Після цього висновку зайві цифри можна видалити з Приміток, щоб уникнути плутанини. Отже, ви знаєте, як застосовувати техніку прихованих пар у судоку. Тепер настав час потренуватися!",
  "Hidden triples technique": "Техніка прихованих трійок",
  "Hidden triples technique is very similar to Hidden pairs and works on the same concept. Hidden triples applies when three cells in a row, column, or 3x3 block contain the same three Notes. These three cells also contain other candidates, which may be removed from them. It will be easier to understand this technique if you look at the example. Take a look at the highlighted cells. There are only three cells, which contain repeated numbers: 5, 6 and 7. This means each of these numbers must occupy one of these cells. And any other numbers cannot be found here. If so, 5,6 and 7 cannot be presented in any other cell of this 3x3 block as well. After this conclusion, extra numbers can be deleted from the Notes to avoid confusion. That is how Hidden Triples technique works while solving Sudoku.": "Техніка прихованих трійок дуже схожа на техніку прихованих пар і працює за тією ж концепцією. Приховані трійки застосовуються, коли три клітинки в рядку, стовпці або блоці 3x3 містять однакові три нотатки. Ці три комірки також містять інші кандидати, які можуть бути з них видалені. Зрозуміти цю техніку буде простіше, якщо подивитися на приклад. Подивіться на виділені клітинки. Є лише три клітинки, які містять повторювані числа: 5, 6 і 7. Це означає, що кожне з цих чисел повинно займати одну з цих клітинок. І будь-яких інших номерів тут знайти неможливо. Якщо так, то 5,6 і 7 також не можуть бути представлені в жодній іншій комірці цього блоку 3x3. Після цього висновку зайві цифри можна видалити з Приміток, щоб уникнути плутанини. Так працює техніка «Приховані трійки» під час вирішення судоку.",
  "Pointing pairs technique": "Техніка вказівних пар",
  "Pointing pairs applies when a Note is present twice in a block and this Note also belongs to the same row or column. This means that the Note must be the solution for one of the two cells in the block. So, you can eliminate this Note from any other cells in the row or column. To understand Pointing pairs better, let's take a look at the example. Let's look at the block at the top left corner. All the cells that might contain number 4 are located in one column. As number 4 should appear in this block at least once, one of the highlighted cells will surely contain 4. Hence, we can safely eliminate all other possible 4s from all the cells of this column. Remember that you can do the same trick for blocks, rows, and columns. That's it for Pointing pairs technique. Now you can proceed with the following Sudoku strategy Pointing triples.": "Вказівні пари застосовуються, коли примітка присутня двічі в блоці, і ця примітка також належить до того самого рядка чи стовпця. Це означає, що Note має бути рішенням для однієї з двох комірок у блоці. Отже, ви можете видалити цю примітку з будь-яких інших комірок у рядку чи стовпці. Щоб краще зрозуміти вказівні пари, давайте подивимося на приклад. Давайте подивимося на блок у верхньому лівому куті. Усі клітинки, які можуть містити число 4, розташовані в одному стовпчику. Оскільки число 4 повинно з’явитися в цьому блоці принаймні один раз, одна з виділених комірок обов’язково міститиме 4. Отже, ми можемо безпечно видалити всі інші можливі 4 з усіх комірок цього стовпця. Пам’ятайте, що ви можете зробити той самий трюк для блоків, рядків і стовпців. Це все для техніки вказівних пар. Тепер ви можете продовжити наступну стратегію судоку, вказуючи трійки.",
  "Pointing triples technique": "Техніка вказівних трійок",
  "Pointing triples technique is very similar to Pointing pairs. It applies if a Note is present in only three cells of a 3x3 block and also belongs to the same row or column. This means that the Note must be a solution for one of these three cells in the block. So, obviously it can't be a solution of any other cell in the row or column and can be eliminated from them. For example: Let's take a look at the bottom right corner. In this block all the cells that might contain number 1 are located in one row. As number 1 must appear in the bottom right block at least once, one of the highlighted cells will surely contain 1. After this conclusion all other possible numbers 1 can be safely deleted from the Notes of this row to avoid confusion. Remember that you can do the same trick for blocks, rows, and columns. That is how Pointing Triples technique works. Once you have learned it, you can get some practice.": "Техніка вказівних трійок дуже схожа на техніку вказівних пар. Це застосовується, якщо примітка присутня лише в трьох клітинках блоку 3x3 і також належить до того самого рядка чи стовпця. Це означає, що Note має бути рішенням для однієї з цих трьох комірок у блоці. Отже, очевидно, що це не може бути розв’язком будь-якої іншої комірки в рядку чи стовпці та може бути вилучено з них. Наприклад: Давайте поглянемо на нижній правий кут. У цьому блоці всі комірки, які можуть містити цифру 1, розташовані в одному рядку. Оскільки число 1 має з’явитися в нижньому правому блоці принаймні один раз, одна з виділених клітинок обов’язково міститиме 1. Після цього висновку всі інші можливі числа 1 можна безпечно видалити з приміток цього рядка, щоб уникнути плутанини. Пам’ятайте, що ви можете зробити той самий трюк для блоків, рядків і стовпців. Ось як працює техніка Pointing Triples. Вивчивши це, ви можете трохи попрактикуватися."
}